package com.jeesite.modules.job;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import org.apache.commons.lang3.StringUtils;

import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;
import com.jeesite.common.codec.Md5Utils;
import com.jeesite.common.utils.SpringUtils;
import com.jeesite.modules.mc.entity.McEmp;
import com.jeesite.modules.mc.service.McEmpService;
import com.jeesite.modules.mc.service.McTextfiledataService;
import com.jeesite.modules.sys.service.AreaService;
import com.jeesite.modules.utils.HttpUtils;

public class EmpJob {

	
	
	
	public static void doJob() throws Exception {
		String url = "http://202.100.92.240:8090/getEmp1";
		
		Map map = new HashMap();
		map.put("hy_name", "");
		map.put("code","620000");
		map.put("stream_code","");
		
		
		String infos = new HttpUtils().sendGet(url, map);
	
		List<McEmp> list = JSONArray.parseArray(infos, McEmp.class);
		
		McEmpService mcEmpService = SpringUtils.getBean("mcEmpService");
	
		Map<String,String> areaMap =  new HashMap();
		areaMap.put("甘南州-合作市","623001");
		areaMap.put("甘南州-临潭县","623021");
		areaMap.put("甘南州-卓尼县","623022");
		areaMap.put("甘南州-舟曲县","623023");
		areaMap.put("甘南州-迭部县","623024");
		areaMap.put("甘南州-玛曲县","623025");
		areaMap.put("甘南州-碌曲县","623026");
		areaMap.put("甘南州-夏河县","623027");
		String json = "[{name:\"池沟\",smx:103.643046072119,smy:34.9861549436957},{name:\"尼什峡\",smx:103.402766300524,smy:34.004321251025,jbqk:\"位于迭部县的东约30km处嘉陵江一级支流—白龙江干流上.设计总装机容量为1.0万kW（2×5000kW）,初设工程总投资为3000万元.工程年发电量为4700~5000万kW/h,装机年利用小时数6970h,保证出力6560kW\"},{name:\"阿万仓\",smx:101.686622241124,smy:33.7674701114565,jbqk:\"位于甘南州玛曲县\"},{name:\"达拉河口\",smx:103.390276595089,smy:33.8868927344122,jbqk:\"达拉位于甘肃省甘南州迭部县城东南30公里处,坝高76米,总库容量1506万立方米,装机容量5.25万千瓦,年发电量2.73亿千瓦,工程总投资4.4亿元\"},{name:\"尼什峡\",smx:103.444677883378,smy:33.9890288695867,jbqk:\"迭部县的东约30km处嘉陵江一级支流—白龙江干流上.设计总装机容量为1.0万kW（2×5000kW）,初设工程总投资为3000万元.工程年发电量为4700~5000万kW·h,装机年利用小时数6970h,保证出力6560kW.\"},{name:\"扎尕\",smx:104.562007665022,smy:33.3448654781594,jbqk:\"位于甘南藏族自治州迭部县西北方向的益哇乡境内\"},{name:\"岔坪\",smx:104.579283781821,smy:33.3513872591147,jbqk:\"未知\"},{name:\"东益\",smx:104.606479350642,smy:33.3670693725535,jbqk:\"未知\"},{name:\"铁坝\",smx:104.612942979635,smy:33.3778964851347,jbqk:\"未知\"},{name:\"瓜子沟一级\",smx:104.681464805756,smy:33.391009836235,jbqk:\"未知\"},{name:\"铁坝二级\",smx:104.610264637603,smy:33.4074762538261,jbqk:\"未知\"},{name:\"大年二级\",smx:104.674807069791,smy:33.4212377139494,jbqk:\"未知\"},{name:\"曹世坝\",smx:103.671275339685,smy:33.9442412431389,jbqk:\"未知\"},{name:\"尼傲峡\",smx:103.586524091614,smy:33.9583359218653,jbqk:\"尼傲峡位于卓尼县城以东约40公里的白龙江干流上,设计总装机容量为1.2万千瓦,年发电量为8600万度,年产值1376万元.1993年投建,1999年一期工程建成并试运行发电,2003年年底二期工程三号机组完成安装并运行发电.\"},{name:\"小尼傲\",smx:103.534897404292,smy:33.9701214941117,jbqk:\"未知\"},{name:\"曲玛\",smx:104.274921741345,smy:33.4684146322296,jbqk:\"未知\"},{name:\"大年力族坝\",smx:104.570475676012,smy:33.4699482047459,jbqk:\"甘肃甘南舟曲县曲告纳乡力族坝\"},{name:\"缠坪坝\",smx:104.546735901441,smy:33.488442267097,jbqk:\"未知\"},{name:\"驼骆坝\",smx:104.495855423889,smy:33.5176908730354,jbqk:\"位于甘南州舟曲县拱坝乡脱落村\"},{name:\"拱坝阳庄坝\",smx:104.460494974963,smy:33.5386292756206,jbqk:\"未知\"},{name:\"干间坝\",smx:104.44269772532,smy:33.5549329950617,jbqk:\"未知\"},{name:\"嘎尔隆一级\",smx:104.345202930971,smy:33.5637181204949,jbqk:\"嘎尔隆是拱坝河流域综合开发的重要阶梯式,该由主厂房、控制室、高压室和升压站组成,装机容量为3600KW,设计年平均发电量为1539万kw.\"},{name:\"插岗二级\",smx:104.413071170298,smy:33.5686325521506,jbqk:\"插岗二级位于甘南州舟曲县插岗乡拱坝河支流嘎尔隆沟内,属低坝径流引水式,由陇南顺通公司修建,装机容量２×１０００千瓦,投资１２６０万元；\"},{name:\"插岗乡\",smx:104.37860837068,smy:33.5732681678917,jbqk:\"嘎尔隆位于甘南州舟曲县插岗乡拱坝河支流嘎尔隆沟内,属低坝径流引水式,由取水枢纽、引水渠道、前池、压力管道、升压站、发电厂房、尾水等组成.项目总投资2300万元,总装机容量3600千瓦,设计年发电量1600万千瓦时,年产值约350万元.\"},{name:\"插岗嘎尔隆二级\",smx:104.35082504544,smy:33.5811843494782,jbqk:\"嘎尔隆位于甘南州舟曲县插岗乡拱坝河支流嘎尔隆沟内,属低坝径流引水式,由取水枢纽、引水渠道、前池、压力管道、升压站、发电厂房、尾水等组成.项目总投资2300万元,总装机容量3600千瓦,设计年发电量1600万千瓦时,年产值约350万元.\"},{name:\"石门坪\",smx:104.504663245512,smy:33.6748355942873,jbqk:\"石门坪位于甘肃省舟曲县境内的白龙江干流上,距兰州市公路里程约390km；设计引水流量130 立方米/秒,装机容量15MW,工程概算静态投资额1.1亿元.该于2005年4月6日开工建设,10月25日顺利实现了主体河床二期截流,2006年4月28日首台机组并网发电,9月2日三台机组全部投产\"},{name:\"两河口\",smx:104.456345208065,smy:33.7031971242479,jbqk:\"两河口位于舟曲县境内的白龙江干流上,为一低坝径流引水式,设计引水流量75.0m3／s,装机容量1500kw,属四等小(I型)工程.\"},{name:\"虎家崖\",smx:104.403537702803,smy:33.7409415302275,jbqk:\"位于距舟曲县城7公里的江盘乡白龙江干流上,工程静态总投资达2.2亿元,设计装机容量2.8万千瓦,\"},{name:\"锁儿头电站扩机增容\",smx:104.353497150673,smy:33.7812300463297,jbqk:\"锁儿头(沙川坝)工程位于甘肃省舟曲县县城上游约500m的白龙江右岸,两河口~郎木寺公路(S313省道)从坝址左岸通过,该省道向西经迭部县与213国道相连,向东与212国道相连,距兰州市公路里程407km,距陇西市公路里程262km,交通便利.是白龙江尼什峡至沙川坝河段上规划的第13个梯\"},{name:\"阿夏\",smx:103.765450426996,smy:33.8304019900598,jbqk:\"位于甘肃省甘南藏族自治州迭部县\"},{name:\"曲瓦一级\",smx:103.994358628348,smy:33.9150091091831,jbqk:\"位于甘肃省甘南州舟曲县曲瓦乡城马村\"},{name:\"卡坝班九\",smx:103.505910410237,smy:33.9752909330302,jbqk:\"卡坝班九位于迭部县白龙江干流,距卡坝乡政府1公里处,设计总装机容量3000KW,总投资2177万元,年平均发电量1662.7万千瓦时.\"},{name:\"白土坡\",smx:102.649187029058,smy:35.1921669822205,jbqk:\"白土坡位于夏河县达麦乡境内的大夏河上,于1968年10月建成发电,总装机容量4.6兆瓦.\"},{name:\"甫黄二级\",smx:102.730114036034,smy:35.2171616464929,jbqk:\"位于甘肃省甘南州夏河县王格尔塘镇浦黄村,\"},{name:\"多架山\",smx:103.441789285247,smy:34.5871687574323,jbqk:\"多架山位于洮河中游的卓尼县大族乡多架山村,距卓尼县城约8km,现已建成运行.由池洪冲砂闸、溢流坝、副坝组成,最大坝高9m,最大流量61m3/s,总装机7.51NW.\"},{name:\"临潭鹿儿台\",smx:103.241685909477,smy:34.6383749244632,jbqk:\"鹿儿台位于甘南州临潭县术步乡立子滩村附近的洮河干流上 ,坝址位于洮河中上游 ,距上游洮河下巴沟水文站 4 1.5 ,距下游岷县水文站133 ,坝址以上控制流域面积 10 84 1 .\"},{name:\"术布\",smx:103.28475391706,smy:34.6164368453842,jbqk:\"术布位于甘肃省甘南藏族自治州临潭县术布乡术布村附近的洮河干流上,为低坝径流(无调节)引水式.最大水头6.98m,加权平均水头6.49m,最小水头5.34m,设计水头6m;总装机容量3900kW,多年平均发电量2193万kW.h,年利用小时数5623h,\"},{name:\"纽子\",smx:103.40872867349,smy:34.582398901688,jbqk:\"扭子位于甘肃省甘南藏族自治州卓尼县城上游的洮河干流上,为一径流引水式.引水隧洞长4393.114m,设计引用流量138.6m3/s,装机容量30MW,为单一发电工程,无灌溉、防洪等要求.\"},{name:\"大庄\",smx:102.789219863206,smy:34.5458987725104,jbqk:\"大庄位于甘肃省甘南藏族自治州碌曲县境内的洮河干流上,为低坝无调节引水式,安装2台5.5MW轴流式发电机组,总装机容量11MW\"},{name:\"阿拉山\",smx:102.631632866164,smy:34.5415646976527,jbqk:\"阿拉山位于甘肃甘南藏族自治州碌曲县西仓乡境内的洮河干流上,设计总装机容量９０００千瓦（3×3000千瓦）,年发电量４８１８万千瓦时.该工程是２００１年６月开工兴建的,是洮河水电开发规划中开工兴建的,是洮河水电开发规划中的第三座梯级,建成投运后,可实现年销\"},{name:\"亚古\",smx:103.245197336688,smy:34.0475606873759,jbqk:\"位于甘南藏族自治州迭部县\"},{name:\"峡村\",smx:102.988449829096,smy:34.6705810903451,jbqk:\"位于甘肃省甘南藏族自治州合作市勒秀乡峡村的洮河干流上,为低坝径流引水式,技术改造后总装机容量为19MW,年发电量6512万kW.h,主要建设内容为将原有3×2000kW机组更换为3×3000kW机组,并新增2×5MW的机组,配套建设引水隧道、发电厂房、尾水渠等.新建引水隧洞长141m,利用\"},{name:\"俄合\",smx:103.057603424459,smy:34.6787089525562,jbqk:\"未知\"},{name:\"青石山\",smx:103.635919315424,smy:34.5645323925559,jbqk:\"潭县青石山水电有限责任公司,2004年01月10日成立,经营范围包括水力发电、水产养殖、旅游资源开发等.\"},{name:\"贡去乎\",smx:102.679242345758,smy:34.4981754594299,jbqk:\"未知\"},{name:\"县城水电站（碌曲）\",smx:102.487025674495,smy:34.5804753111867,jbqk:\"位于甘南藏族自治州碌曲县\"},{name:\"扎那一级\",smx:103.585282008258,smy:34.4917618579234,jbqk:\"位于甘肃省甘南州卓尼县木耳镇多坝村委会,\"},{name:\"瓜咱沟一级\",smx:104.201578268422,smy:33.7709063238678,jbqk:\"舟曲县瓜子沟一级位于甘肃省甘南藏族自治州舟曲县瓜子沟村\"},{name:\"瓜咱沟二级\",smx:104.21423569742,smy:33.781261412884,jbqk:\"舟曲县瓜子沟二级位于甘肃省甘南藏族自治州舟曲县瓜子沟村\"},{name:\"瓜咱沟三级\",smx:104.228198932135,smy:33.8008136760104,jbqk:\"舟曲县瓜子沟三级位于甘肃省甘南藏族自治州舟曲县瓜子沟村\"},{name:\"扎日塘玛\",smx:103.542490502635,smy:35.0466297782417,jbqk:\"位于甘南藏族自治州迭部县西北约28公里\"},{name:\"水泊峡\",smx:103.902477279903,smy:33.9856583886238,jbqk:\"水泊峡位于甘肃省迭部县县城下游约84km处,是白龙江尼什峡至沙川坝河段梯级开发规划的第七个梯级.水泊峡开发方式为混合开发,的主要任务是发电.\"},{name:\"黄河大桥\",smx:102.079970170987,smy:33.9593655799576,jbqk:\"未知\"},{name:\"腊子口二级\",smx:103.894966636801,smy:34.0765591217062,jbqk:\"腊子口二级装机容量5100千瓦,采用隧道引流方式,设计引水流量为每秒8.7立方米,把河道中的水引入长3.8公里的隧道,依靠76米的落差发电.\"},{name:\"腊子口一级\",smx:103.891920157289,smy:34.1239218669007,jbqk:\"腊子口一级采用隧道引流方式,设计引水流量为每秒10.8立方米,把河道中的水引入隧道,依靠落差发电.\"},{name:\"多儿河口\",smx:103.725780053607,smy:33.9424290057941,jbqk:\"多儿位于甘肃省迭部县白龙江一级支流多儿河上;距迭部县县城下游65公里处,总装机32(3*10+1*2)兆瓦\"},{name:\"电尕\",smx:103.204528808458,smy:34.0803222664595,jbqk:\"位于甘南迭部县电尕镇\"},{name:\"白云\",smx:103.373379681927,smy:34.0117560003392,jbqk:\"位于甘南藏族自治州迭部县\"},{name:\"郎木寺镇\",smx:102.578735352255,smy:34.1035156246464,jbqk:\"位于甘南州碌曲县郎木寺镇\"},{name:\"安果尔\",smx:103.030031474973,smy:34.6838352303117,jbqk:\"设计为低坝式引水式,主要由枢纽大坝,引水涵洞、厂房三部分组成\"},{name:\"吉仓\",smx:102.849426492938,smy:34.7262313112261,jbqk:\"未知\"},{name:\"丁字河口三级\",smx:104.609935577465,smy:33.4326401875946,jbqk:\"2014年经甘肃省电力公司批复同意建设,为优化电网结构,提高电网抗事故能力,丁子河口将110千伏丁字河口原有2×31.5兆伏安主变增容改换为2×63兆伏安,它也是甘南公司110千伏单台容量最大的主变.\"},{name:\"尼傲加尕水电\",smx:103.544936548883,smy:33.9620345861273,jbqk:\"尼傲加尕为坝后式,属Ⅳ等小(1)型工程,枢纽建筑物由左向右依次为左岸挡水副坝、两孔泄洪底孔坝段、三孔进水口坝段和右岸挡水副坝组成.装机容量12.9MW.设计发电流量63.3m3/s,冬季最小发电流量10.55m3/s,多年平均发电量6675万kwh,\"},{name:\"夏河机场\",smx:102.620845839964,smy:34.8247203762444,jbqk:\"甘南夏河机场位于甘肃省甘南州夏河县库塞塘村附近,距离夏河县和合作市分别为72公里和56公里,是我国民用机场布局规划以及民航西北地区、甘肃省民航发展规划的重点项目之一.总用地约2600亩,机场飞行区等级按4C级标准建设,跑道长3200米.航站区按满足2020年旅客吞吐量14万人次、\"},{name:\"云江峡\",smx:103.577341408279,smy:34.5371860362067,jbqk:\"于2005年8月开工建设,经过不断优化,设计装机容量为（2630KW+630KW）引数量11.8m3/s,年平均发电量1361万KW.h装机年利用小时数5175h,属1V小型径流式水力发.\"}]";
		
		
		for(int i=0;i<list.size();i++) {
			if(StringUtils.isEmpty(list.get(i).getCollectionTime().trim())) {
				list.remove(i);
				i--;
			}
		}
		int count = 0;
		List<String> notFound = new ArrayList();
		List<String> found = new ArrayList();
		for (McEmp mcEmp : list) {
			mcEmp.setAreacode(
					areaMap.get(mcEmp.getHyAddress())
					);
			try {
				
				if(json.contains("\"" + mcEmp.getHyName() + "\"")) {
					count++;
					found.add(mcEmp.getHyName());
					mcEmp.setId(Md5Utils.md5(mcEmp.getHyId() + mcEmp.getCollectionTime()));
					mcEmp.setIsNewRecord(true);
					mcEmpService.insert(mcEmp);
				}else {
					notFound.add(mcEmp.getHyName());
					System.out.println(mcEmp.getHyName() );
				}
			}catch(Exception err) {
			}
		} 
		System.out.println(count);
	}
	
}
